#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    int num, a, b, n, ans, k;
    double p, sum;
    cout << "Если вам необходимо завершить программу, введите 0.\n\n";
    cout << "---------------------------\n\n";
    cout << "Введите номер задания:\n";

    cin >> num;
    while (num != 0) {

        if (num == 1) {
            cout << "Введите целые положительные числа А и В (A < B):\n";
            cin >> a >> b;
            cout << "\n";
            for (int i = a; i <= b; i++) {
                for (int j = 0; j < i; j++) {
                    cout << i << " ";
                }
                cout << endl;
            }
            cout << "\n";
        }

        if (num == 2) {
            cout << "Введите положительные числа А и В (A > B):\n";
            cin >> a >> b;
            for (; a - b >= 0; a -= b) {}
            cout << "Длина незанятой части отрезка А равна: " << a << "\n\n";
        }

        if (num == 3) {
            cout << "Введите целое число N (> 1):\n";
            cin >> n;
            ans = 0;
            for (k = 0; ans < n; k++, ans += k) {}
            cout << "Найденное наименьшее K равно: " << k 
                << "\nСумма равна: " << ans << "\n\n";
        }

        if (num == 4) {
            cout << "Введите P процентов (0 < P < 25, Р - вещественное число):\n";
            cin >> p;
            sum = 1000;
            p *= 0.01;
            //cout << p << endl;
            for (k = 0; sum <= 1100; k++, sum += sum * p) {}
            cout << "Через " << k << " месяцев размер вклада превысит 1100 руб.\n" 
                << "Итоговый размер вклада равен: " << sum << "\n\n";
        }

        if (num == 5) {
            cout << "Введите целые положительные числа А и В:\n";
            cin >> a >> b;
            while (a != 0 and b != 0) {
                if (a > b) {
                    a %= b;
                }
                else
                    b %= a;
            }
            
            cout << "Их наибольший общий делитель равен: " << a + b << "\n\n";
        }

        if (num == 6) {
            cout << "Введите целое число N (> 1), являющееся числом Фибоначчи:\n";
            cin >> n;
            if (n == 0)
                k = 1;
            else {
                for (a = 1, b = 1, k = 3; n != a; a = a + b, b = a - b, k++) {
                    if (n < a) {
                        k = -1;
                        break;
                    }
                }
            }
            if (k == -1) {
                cout << "N не является числом Фибоначчи.\n\n";
            }
            else {
                if (k == 3)
                    cout << "Порядковый номер числа Фибоначчи N может быть как 2, так и 3.\n\n";
                else
                    cout << "Порядковый номер числа Фибоначчи N: " << k << ".\n\n";
            }
        }

        if (num < 0 || num > 6) {
            cout << "К сожалению, такого задания нет.\n\n";
        }

        cout << "---------------------------\n\n";

        cout << "Введите номер задания:\n";
        cin >> num;
    }
    return 0;
}