#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");

    int num, day, month, n, ans, a;
    char c;
    double ans1, ans2;
    cout << "Если вам необходимо завершить программу, введите 0.\n\n";
    cout << "---------------------------\n\n";
    cout << "Введите номер задания:\n";

    cin >> num;
    while (num != 0) {
        if (num == 1) {
            cout << "Введите номер дня от 1 до 31:\n";
            cin >> day;
            cout << "Введите номер месяца от 1 до 12:\n";
            cin >> month;
            if (day < 1 || day > 31 || month < 1 || month > 12) {
                cout << "Введен неверный номер дня или месяца.\n\n";
            }
            else 
                if ((day > 29 && month == 2) || (day > 30 && month == 4) || (day > 30 && month == 6)
                    || (day > 30 && month == 9) || (day > 30 && month == 11))
                        cout << "Такого дня в данном месяце не существует.\n\n";
            else {
                if (day == 1) cout << "Первое ";
                if (day == 2) cout << "Второе ";
                if (day == 3) cout << "Третье ";
                if (day == 4) cout << "Четвёртое ";
                if (day == 5) cout << "Пятое ";
                if (day == 6) cout << "Шестое ";
                if (day == 7) cout << "Седьмое ";
                if (day == 8) cout << "Восьмое ";
                if (day == 9) cout << "Девятое ";
                if (day == 10) cout << "Десятое ";
                if (day == 11) cout << "Одиннадцатое ";
                if (day == 12) cout << "Двенадцатое ";
                if (day == 13) cout << "Тринадцатое ";
                if (day == 14) cout << "Четырнадцатое ";
                if (day == 15) cout << "Пятнадцатое ";
                if (day == 16) cout << "Шестнадцатое ";
                if (day == 17) cout << "Семнадцатое ";
                if (day == 18) cout << "Восемнадцатое ";
                if (day == 19) cout << "Девятнадцатое ";
                if (day == 20) cout << "Двадцатое ";
                if (day == 21) cout << "Двадцать первое ";
                if (day == 22) cout << "Двадцать второе ";
                if (day == 23) cout << "Двадцать третье ";
                if (day == 24) cout << "Двадцать четвёртое ";
                if (day == 25) cout << "Двадцать пятое ";
                if (day == 26) cout << "Двадцать шестое ";
                if (day == 27) cout << "Двадцать седьмое ";
                if (day == 28) cout << "Двадцать восьмое ";
                if (day == 29) cout << "Двадцать девятое ";
                if (day == 30) cout << "Тридцатое ";
                if (day == 31) cout << "Тридцать первое ";

                if (month == 1) cout << "января.\n\n";
                if (month == 2) cout << "февраля.\n\n";
                if (month == 3) cout << "марта.\n\n";
                if (month == 4) cout << "апреля.\n\n";
                if (month == 5) cout << "мая.\n\n";
                if (month == 6) cout << "июня.\n\n";
                if (month == 7) cout << "июля.\n\n";
                if (month == 8) cout << "августа.\n\n";
                if (month == 9) cout << "сентября.\n\n";
                if (month == 10) cout << "октября.\n\n";
                if (month == 11) cout << "ноября.\n\n";
                if (month == 12) cout << "декабря.\n\n";
            }

            cout << "---------------------------\n\n";
        }

        if (num == 2) {
            cout << "Робот может перемещаться в четырёх направлениях.\n"
                << "Введите N, если исходное направление робота Север.\n" 
                << "Введите W, если исходное направление робота Запад.\n"
                << "Введите S, если исходное направление робота Юг.\n"
                << "Введите E, если исходное направление робота Восток.\n\n";

            cout << "Робот может принимать три цифровые команды:\n"
                << "Введите 0 для продолжения движения.\n"
                << "Введите 1 для поворота налево.\n"
                << "Введите -1 для поворота направо.\n\n";

            cout << "Введите исходное направление робота:\n";
            cin >> c;
            cout << "Введите цифровую команду роботу:\n";
            cin >> n;
            if (c == 'N') ans = 0;
            if (c == 'W') ans = 1;
            if (c == 'S') ans = 2;
            if (c == 'E') ans = 3;

            if (ans == 0 && n == -1) 
                ans = 3;
            else
                if (ans == 3 && n == 1) 
                    ans = 0;
                else 
                    ans += n;

            if (ans == 0) 
                cout << "Направление робота после выполнения команды: Север.\n\n";
            if (ans == 1)
                cout << "Направление робота после выполнения команды: Запад.\n\n";
            if (ans == 2)
                cout << "Направление робота после выполнения команды: Юг.\n\n";
            if (ans == 3)
                cout << "Направление робота после выполнения команды: Восток.\n\n";

            cout << "---------------------------\n\n";
        }

        if (num == 3) {
            cout << "Введите количество учебный заданий в диапазоне 10-40:\n";
            cin >> n;
            if (n < 10 || n > 40)
                cout << "Введено неверное число.\n\n";
            else {
                if (n == 10) cout << "Десять";
                if (n == 11) cout << "Одиннадцать";
                if (n == 12) cout << "Двенадцать";
                if (n == 13) cout << "Тринадцать";
                if (n == 14) cout << "Четырнадцать";
                if (n == 15) cout << "Пятнадцать";
                if (n == 16) cout << "Шестнадцать";
                if (n == 17) cout << "Семнадцать";
                if (n == 18) cout << "Восемнадцать";
                if (n == 19) cout << "Девятнадцать";

                if (n > 19) {
                    if (n / 10 == 2) cout << "Двадцать";
                    if (n / 10 == 3) cout << "Тридцать";
                    if (n / 10 == 4) cout << "Сорок";
                    
                    if (n % 10 == 1) cout << " один";
                    if (n % 10 == 2) cout << " два";
                    if (n % 10 == 3) cout << " три";
                    if (n % 10 == 4) cout << " четыре";
                    if (n % 10 == 5) cout << " пять";
                    if (n % 10 == 6) cout << " шесть";
                    if (n % 10 == 7) cout << " семь";
                    if (n % 10 == 8) cout << " восемь";
                    if (n % 10 == 9) cout << " девять";
                }

                cout << " учебных заданий.\n\n";
            }
            cout << "---------------------------\n\n";
        }

        if (num == 4) {
            cout << "Введите целое число в диапазоне 100-999:\n";
            cin >> n;
            if (n < 100 || n > 999)
                cout << "Введено неверное число.\n\n";
            else {
                if (n / 100 == 1) cout << "Сто";
                if (n / 100 == 2) cout << "Двести";
                if (n / 100 == 3) cout << "Триста";
                if (n / 100 == 4) cout << "Четыреста";
                if (n / 100 == 5) cout << "Пятьсот";
                if (n / 100 == 6) cout << "Шестьсот";
                if (n / 100 == 7) cout << "Семьсот";
                if (n / 100 == 8) cout << "Восемьсот";
                if (n / 100 == 9) cout << "Девятьсот";

                n %= 100;
                if (n < 20 && n > 9) {
                    if (n == 10) cout << " десять";
                    if (n == 11) cout << " одиннадцать";
                    if (n == 12) cout << " двенадцать";
                    if (n == 13) cout << " тринадцать";
                    if (n == 14) cout << " четырнадцать";
                    if (n == 15) cout << " пятнадцать";
                    if (n == 16) cout << " шестнадцать";
                    if (n == 17) cout << " семнадцать";
                    if (n == 18) cout << " восемнадцать";
                    if (n == 19) cout << " девятнадцать";
                }
                else {
                    if (n / 10 == 2) cout << " двадцать";
                    if (n / 10 == 3) cout << " тридцать";
                    if (n / 10 == 4) cout << " сорок";
                    if (n / 10 == 5) cout << " пятьдесят";
                    if (n / 10 == 6) cout << " шестьдесят";
                    if (n / 10 == 7) cout << " семьдесят";
                    if (n / 10 == 8) cout << " восемьдесят";
                    if (n / 10 == 9) cout << " девяносто";

                    if (n % 10 == 1) cout << " один";
                    if (n % 10 == 2) cout << " два";
                    if (n % 10 == 3) cout << " три";
                    if (n % 10 == 4) cout << " четыре";
                    if (n % 10 == 5) cout << " пять";
                    if (n % 10 == 6) cout << " шесть";
                    if (n % 10 == 7) cout << " семь";
                    if (n % 10 == 8) cout << " восемь";
                    if (n % 10 == 9) cout << " девять";
                }
                cout << ".\n\n";
            }
            cout << "---------------------------\n\n";
        }

        if (num == 5) {
            cout << "Введите номер года, учитывая, что номер должен быть больше или равен 1984:\n";
            cin >> n;
            if (n < 1984) {
                cout << "Введено неверное число.\n\n";
            }
            else {
                cout << "Год";
                n -= 1983;
                a = 0;
                ans = 0;
                while (a < n) {
                    ans++;
                    a += 12;
                }

                    //cout << ans << endl;

                if (ans % 5 == 0) {
                    if (n % 12 == 3 || n % 12 == 4 || n % 12 == 5) {
                        cout << " черного";
                    }
                    else cout << " черной";
                }
                if (ans % 5 == 1) {
                    if (n % 12 == 3 || n % 12 == 4 || n % 12 == 5) {
                        cout << " зеленого";
                    }
                    else cout << " зеленой";
                }

                if (ans % 5 == 2) {
                    if (n % 12 == 3 || n % 12 == 4 || n % 12 == 5) {
                        cout << " красного";
                    }
                    else cout << " красной";
                }

                if (ans % 5 == 3) {
                    if (n % 12 == 3 || n % 12 == 4 || n % 12 == 5) {
                        cout << " желтого";
                    }
                    else cout << " желтой";
                }

                if (ans % 5 == 4) {
                    if (n % 12 == 3 || n % 12 == 4 || n % 12 == 5) {
                        cout << " белого";
                    }
                    else cout << " белой";
                }

                if (n % 12 == 0) cout << " свиньи";
                if (n % 12 == 1) cout << " крысы";
                if (n % 12 == 2) cout << " коровы";
                if (n % 12 == 3) cout << " тигра";
                if (n % 12 == 4) cout << " зайца";
                if (n % 12 == 5) cout << " дракона";
                if (n % 12 == 6) cout << " змеи";
                if (n % 12 == 7) cout << " лошади";
                if (n % 12 == 8) cout << " овцы";
                if (n % 12 == 9) cout << " обезьяны";
                if (n % 12 == 10) cout << " курицы";
                if (n % 12 == 11) cout << " собаки";

                cout << ".\n\n";
            }
            cout << "---------------------------\n\n";
        }

        if (num < 0 || num > 5) {
            cout << "К сожалению, такого задания нет.\n\n";
        }

        cout << "Введите номер задания:\n";
        cin >> num;
    }
    return 0;
}

